<!doctype html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>Politique de confidentialit&eacute; - Code Scan</title>
  <style>
    body {
      font-family: Arial, sans-serif;
      max-width: 900px;
      margin: 40px auto;
      padding: 0 16px;
      line-height: 1.6;
      color: #111;
    }
    h1, h2 {
      color: #0a8a3a;
    }
    .note {
      font-size: 0.95em;
      color: #444;
    }
  </style>
</head>
<body>
  <h1>Politique de confidentialit&eacute; - Code Scan</h1>
  <p>Date d&apos;effet: 2026-01-05</p>

  <h2>R&eacute;sum&eacute;</h2>
  <ul>
    <li>Pas de compte utilisateur.</li>
    <li>Traitement local sur l&apos;appareil pour le scan.</li>
    <li>Donn&eacute;es stock&eacute;es localement: historique, favoris, notes, pr&eacute;f&eacute;rences.</li>
    <li>Pas de serveur, pas de collecte publicitaire.</li>
    <li>Partage uniquement si vous l&apos;initiez (partage Android ou envoi vers PC via Bluetooth).</li>
  </ul>

  <h2>Donn&eacute;es trait&eacute;es</h2>
  <ul>
    <li>Cam&eacute;ra: le flux vid&eacute;o est utilis&eacute; pour d&eacute;tecter les codes-barres. Les images ne sont pas stock&eacute;es ni envoy&eacute;es.</li>
    <li>Historique de scan: codes, type, date/heure, notes, favoris.</li>
    <li>Bluetooth (PC Link): nom de l&apos;appareil, statut de connexion; les codes sont envoy&eacute;s au PC comme saisie clavier.</li>
    <li>Presse-papiers: copie du code lorsque vous utilisez la fonction de copie.</li>
  </ul>

  <h2>Utilisation des donn&eacute;es</h2>
  <ul>
    <li>Scanner des codes-barres et afficher le r&eacute;sultat.</li>
    <li>G&eacute;rer l&apos;historique, les favoris et les notes.</li>
    <li>Envoyer un code vers un PC via Bluetooth (mode douchette).</li>
  </ul>

  <h2>Partage et services tiers</h2>
  <ul>
    <li>Aucune vente de donn&eacute;es et pas de publicit&eacute;.</li>
    <li>Pas de serveur d&apos;application: les donn&eacute;es restent sur l&apos;appareil.</li>
    <li>Biblioth&egrave;que ML Kit (Google) utilis&eacute;e pour la lecture des codes-barres, avec traitement local sur l&apos;appareil.</li>
    <li>Le partage ne se fait que si vous l&apos;initiez (intent Android, envoi Bluetooth).</li>
  </ul>

  <h2>Stockage et s&eacute;curit&eacute;</h2>
  <p>
    Les donn&eacute;es sont stock&eacute;es localement sur l&apos;appareil. Vous pouvez supprimer
    l&apos;historique depuis l&apos;application. Si la sauvegarde Android est activ&eacute;e,
    certaines donn&eacute;es peuvent &ecirc;tre sauvegard&eacute;es par le syst&egrave;me.
  </p>

  <h2>Permissions</h2>
  <ul>
    <li>Cam&eacute;ra: n&eacute;cessaire pour scanner.</li>
    <li>Bluetooth: n&eacute;cessaire pour le mode PC Link.</li>
    <li>Vibration: retour haptique lors de la validation d&apos;un scan.</li>
  </ul>

  <h2>Enfants</h2>
  <p>
    L&apos;application n&apos;est pas con&ccedil;ue pour les enfants de moins de 13 ans
    et ne collecte pas sciemment de donn&eacute;es d&apos;enfants.
  </p>

  <h2>Contact</h2>
  <p>
    Pour toute question: <strong>finjalrac@gmail.com</strong>
  </p>
</body>
</html>
